<a href="https://colab.research.google.com/github/jumbokh/ML-Class/blob/main/notebooks/1_2_Pandas_DataFrame.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

## 習題

1. 請將串列[8, 2, 4]轉換成Seires的資料型態，請問這是一維還是二維的資料型態？

In [1]:
import pandas as pd
s = pd.Series([8, 2, 4])
print(f'{s.shape}為一維')

(3,)為一維

2. 請將上例結果轉換成二維的Data Frame。

In [2]:
s.to_frame()

   0
0  8
1  2
2  4

3. 假設有一筆資料scores = {'Math':[90,np.nan,70,80],
                        'English':[60,70,'90',50],
                        'History':[33,np.nan,188,60]}
請先將它匯入至df
df = pd.DataFrame(scores, index=['Simon','Allen','Jimmy','Peter'])
(1) 請將English裡有問題的'90'改為數字90
(2) 請將History裡的188，改成88
(3) 請將遺漏值nan，設為各自欄位的平均值

In [3]:
import numpy as np
from IPython.display import display
scores = {'Math':[90,np.nan,70,80],
          'English':[60,70,'90',50],
          'History':[33,np.nan,188,60]}
df = pd.DataFrame(scores, index=['Simon','Allen','Jimmy','Peter'])
print("答案1")
df['English'] = df['English'].replace('90',90).astype(int)
display(df['English'])
print("答案2")
df['History'] = df['History'].replace(188, 88)
display(df['History'])
print("答案3")
display(df.fillna(df.mean()))

答案1

Simon    60
Allen    70
Jimmy    90
Peter    50
Name: English, dtype: int64

答案2

Simon    33.0
Allen     NaN
Jimmy    88.0
Peter    60.0
Name: History, dtype: float64

答案3

       Math  English    History
Simon  90.0       60  33.000000
Allen  80.0       70  60.333333
Jimmy  70.0       90  88.000000
Peter  80.0       50  60.000000